cask_args appdir: '/Applications'

tap "github/bootstrap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "puma/puma"

brew "autoconf"
brew "ecm"
brew "libpng"
brew "freetype"
brew "jpeg"
brew "libtiff"
brew "libtool"
brew "graphicsmagick"
brew "xz"
brew "imagemagick"
brew "launch_socket_server", restart_service: true
brew "launchdns", restart_service: true
brew "libmaxminddb"
brew "openssl"
brew "mysql", restart_service: true
brew "pcre"
brew "nginx", restart_service: true
brew "nvm"
brew "node"
brew "node-build"
brew "openssl@1.1"
brew "pkg-config"
brew "readline", link: true
brew "postgresql@14", restart_service: true
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: true
brew "sqlite"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-completions"


cask "bartender"
cask "browserosaurus"
cask "istat-menus"
cask "visual-studio-code"
cask "firefox@developer-edition"
cask "google-chrome"
cask "chromedriver"
cask "iterm2"
cask "keepingyouawake"
cask "quitter"
cask "slack"
cask "Spotify"
cask "tableplus"
cask "warp"
cask "WhatsApp"
cask "notion"
cask "zoom"
cask "telegram"
cask "beardedspice"
cask "bitwarden"
cask "logi-options-plus"
cask "monitorcontrol"
cask "rectangle"
